# Queries: Sakila (Core)

![png](https://s3.amazonaws.com/General_V88/boomyeah/company_209/chapter_3569/handouts/chapter3569_5431_sakila-db-model.png)

In [4]:
import pandas as pd
from sqlalchemy import create_engine

In [ ]:
# load data - change the path to match your drive!
school_df = pd.read_csv('/content/School_Details.csv')
# make sure it loaded correctly
school_df.head(2)

In [ ]:
# create sqlite engine for a database called schools
engine = create_engine('sqlite:///schools.db', echo=True)
# create connection to engine
conn = engine.connect()

In [ ]:
# add the dataframe as a table in sqlite
sqlite_table = "school_details"
school_df.to_sql(sqlite_table, conn, if_exists='fail')

1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [3]:
sql = """
SELECT c.first_name, c.last_name, c.email, a.address, t.city, t.city_id
FROM address a 
INNER JOIN customer c
	ON c.address_id = a.address_id
INNER JOIN city t 
	ON a.city_id = t.city_id
WHERE t.city_id = 312;
"""
pd.read_sql_query(sql, engine)

NameError: name 'engine' is not defined

2. What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [ ]:
SELECT f.title, f.description, f.release_year, f.rating, f.special_features, c.name
FROM film f 
INNER JOIN film_category fc
	ON f.film_id = fc.film_id
INNER JOIN category c
	ON fc.category_id = c.category_id
WHERE  c.name = 'Comedy';

3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [ ]:
SELECT a.last_name, f.title, f.release_year
FROM actor a 
INNER JOIN film_actor fa
	ON a.actor_id = fa.actor_id
INNER JOIN film f
	ON fa.film_id = f.film_id
WHERE  a.last_name = 'Lollobrigida';

4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

SELECT a.first_name, a.last_name
FROM actor a 
INNER JOIN film_actor fa
	ON a.actor_id = fa.actor_id
INNER JOIN film f
	ON fa.film_id = f.film_id
WHERE  f.title = 'Bingo Talented';

5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [ ]:
# Doesn't work

SELECT p.customer_id, p.amount, AVG(p.amount) AS AveragePayment
FROM payment p
GROUP BY p.customer_id
WHERE  p.amount > 2*AveragePayment

6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [ ]:
SELECT c.first_name, c.last_name, COUNT(p.amount) AS num_payments
FROM payment p
INNER JOIN customer c
	ON c.customer_id = p.customer_id
GROUP BY c.customer_id
ORDER BY num_payments DESC
LIMIT 5;